// Это будет тело основного класса - для вызова остальных
using System;

class mMain
{
    static void Main() {
        //  Primer1.Prim1();    //  Простая программа - для пробы (Hello World). 
        //  Primer2.Prim2();    //  Эта программа демонстрирует применение переменных.
        //  Primer3.Prim3();    //  Эта программа демонстрирует отличия между типами данных int и double 
        //  Primer4.Prim4();    //  Вычисление площади круга
        //  Primer5.Prim5();    //  продемонстрировать применение условного оператора if
        //  Primer6.Prim6();    //  продемонстрировать применение оператора цикла for
        //  Primer7.Prim7();    //  форматирование выводимого текста
        //  Primer8.Prim8();    //  Продеменстрировать различия между префиксной и постфиксной формами оператора инкремента (++)
        //  Primer9.Prim9();    //  применение побитового оператора И, для преобразования числа в четное
        //  Primer10.Prim10();  //  Применить побитовый оператор И для определения нечетности числа
        BuildingDemo.BDemo();   //  класс с информацией о зданиях

        Console.ReadLine();
    }
}
